## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_route53_record.reponses-ia-alpha-canada-ca-NS`    |
| delete | `aws_route53_record.reponses-ia-alpha-canada-ca-CNAME` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.reponses-ia-alpha-canada-ca-CNAME will be destroyed
  # (because aws_route53_record.reponses-ia-alpha-canada-ca-CNAME is not in configuration)
  - resource "aws_route53_record" "reponses-ia-alpha-canada-ca-CNAME" {
      - fqdn                             = "reponses-ia.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_reponses-ia.alpha.canada.ca_CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "reponses-ia.alpha.canada.ca" -> null
      - records                          = [
          - "ai-answers.alpha.canada.ca.",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.reponses-ia-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "reponses-ia-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "reponses-ia.alpha.canada.ca"
      + records         = [
          + "ns-1303.awsdns-34.org.",
          + "ns-1561.awsdns-03.co.uk.",
          + "ns-340.awsdns-42.com.",
          + "ns-981.awsdns-58.net.",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.gcdigital-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
